# GetMonitoredLinkElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GetMonitoredLinkElementIds Method
Element Class See Also
---
Provides the link instance IDs when the element is monitoring.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<ElementId> GetMonitoredLinkElementIds()
```

Visual Basic
---
```text
Public Function GetMonitoredLinkElementIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetMonitoredLinkElementIds()
```

# ### Return Value
The IDs of linked instances.
# See Also
Element Class
Autodesk.Revit.DB Namespace